{
  "passages": [
    {
      "text": "Вы уже много лет читаете новости на вашем любимом новостном сайте, не регистрируясь на нём, но вдруг, после прочтения одного из наших уроков вы замечаете, что сверху в левой части адресной строки у данного сайте отсутствует \"замочек\". Что это означает?",
      "links": [
        {
          "name": "Что сайт небезопасен, и следует искать другой",
          "link": "Что сайт небезопасен, и следует искать другой",
          "pid": "2"
        },
        {
          "name": "Что сайт может быть небезопасен, и нужно быть предельно осторожным",
          "link": "Что сайт может быть небезопасен, и нужно быть предельно осторожным",
          "pid": "3"
        },
        {
          "name": "Что можно пользоваться сайтом дальше как обычно",
          "link": "Что можно пользоваться сайтом дальше как обычно",
          "pid": "4"
        }
      ],
      "name": "Untitled Passage",
      "pid": "1",
      "position": {
        "x": "860",
        "y": "368.5"
      }
    },
    {
      "text": "Неправильно. Само по себе отсутствие шифрования, сертификата электронной подписи и поддержки протокола HTTPS не означает что сайт небезопасен для вас. Если вы только читаете новости, и не оставляете на сайте никаких данных, то можете продолжать делать это.",
      "name": "Что сайт небезопасен, и следует искать другой",
      "pid": "2",
      "position": {
        "x": "710",
        "y": "518.5"
      },
      "result": false
    },
    {
      "text": "Неправильно. Несмотря на то, что осторожность в Интернете никогда не повредит, само по себе наличие или остутствие \"замочка\" не говорит ничего о безопасности сайта. Важно то, как вы им пользуетесь. Для интернет-магазина, в котором вы оставляете свои платежные данные и реквизиты, шифрование - строгая необходимость. Для новостного сайта, который вы посещаете анонимно, без регистрации, просто чтобы читать новости - нет.",
      "name": "Что сайт может быть небезопасен, и нужно быть предельно осторожным",
      "pid": "3",
      "position": {
        "x": "860",
        "y": "518.5"
      },
      "result": false
    },
    {
      "text": "Правильно. Если вы не передаёте сайту никаких данных, и просто анонимно, без регистрации, читаете новости - можно продолжать это делать. Здесь шифрование не является строгим требованием безопасности.",
      "name": "Что можно пользоваться сайтом дальше как обычно",
      "pid": "4",
      "position": {
        "x": "1010",
        "y": "518.5"
      },
      "result": true
    }
  ],
  "name": "Любимый новостной сайт",
  "lessonId": 2,
  "startnode": "1",
  "creator": "Twine",
  "creator-version": "2.3.15",
  "ifid": "93BB4BFD-211E-44C4-BE58-8DC2AAF379A5"
}
